import 'app.dart';

/**
фишка в том что абстракные классы не могут наследоваться
от интерфейсов, только имплементироваться

abstract class Bird extends Animal {}
Error: The class 'Animal' can't be extended outside of its library because it's an interface class

соответственно и у всех классов и интерфейсов содификатор abstract запрещает создание экземпляров объекта

интерфейсы можно имплементировать от интерфейсов

и в интерфейсы и в абстрактные классы можно добавлять статические поля,
но в интерфейсах этого не принято делать, т.к. интерфесы являются контрактами на реализацию
а не абстрактной реализацией
 */

void main() {
  
}

abstract class Bird implements Animal {}